<?php error_reporting(-1);
//В массиве А(N) найти: а) число элементов, предшествующих первому отрицательному элементу;
// б) сумму нечетных элементов массива, следующих за последним отрицательным элементом.
$A = [1, 4 , 6 , 3 , 8, 1, 5, -2, 4 , 7, 22, -9, 6, 3, 8, 7, 13];

$counta = 0;
for($i = 0; $i < count($A); $i++){
    if($A[$i] > 0){
        $counta++;
    }elseif($A[$i] < 0){
        break;
    }
}
echo($counta."<br>");

$b = 0;
for($i = count($A) - 1; $i >= 0; $i--){
    if($A[$i] > 0 && $A[$i] % 2 != 0){
        $b += $A[$i];
    }elseif($A[$i] < 0){
        break;
    }
}
echo($b."<br>");